package ua.dp.ort.module2;

public class BitAndByte {

    public static void main(String[] args) {

        // 1 bit   -> 1 or 0
        
        //ВС 0 01 00 01  ПН   (установка бита в 1 для понедельника и пятницы)
        
        //Рабочий или выходной день  0000 0000   ВС  ПН
        // рабочий день в понедельник  1000 0001
        // выходной день в понедельник  0000 0001
        
        // 8 bit  --> 1 byte
        
        //CИ                     СS
// 1k   10^3 = 1000              2^10 = 1024
// 1m   10^6                     2^20
// 1g   10^9                     2^30
// 1t   10^12                    2^40
        
        // Память 2х типов: постоянная и временная
        
        
    }
}
